{
"olderPosts": [
							{
								"id" : 5,
								"heading" : "Is there really a developer shortage?",
								"content" : "Yes it is true that, there is a shortage of software engineers in the industry and this is only going to grow. Yes it is true that, there is a shortage of software engineers in the industry and this is only going to grow. Yes it is true that, there is a shortage of software engineers in the industry and this is only going to grow.  Yes it is true that, there is a shortage of software engineers in the industry and this is only going to grow. Yes it is true that, there is a shortage of software engineers in the industry and this is only going to grow. Yes it is true that, there is a shortage of software engineers in the industry and this is only going to grow. Yes it is true that, there is a shortage of software engineers in the industry and this is only going to grow.",
								"upvotes" : 0
							},
							{
								"id" : 6,
								"heading" : "What words do you find the most fascinating based on the etymology?",
								"content" : "It comes from the Latin fornix, meaning “arch” or “vault.” It comes from the Latin fornix, meanin It comes from the Latin fornix, meaning “arch” or “vault.” It comes from the Latin fornix, meaning “arch” or “vault.” It comes from the Latin fornix, meaning “arch” or “vault.” It comes from the Latin fornix, meaning “arch” or “vault.” It comes from the Latin fornix, meaning “arch” or “vault.”",
								"upvotes":0
							},
							{
								"id" : 7,
								"heading" : "How do I become a software generalist?",
								"content" : "A software ‘generalist’ is a description, just like ‘specialist’ is a description A software ‘generalist’ is a description, just like ‘specialist’ is a description A software ‘generalist’ is a description, just like ‘specialist’ is a description A software ‘generalist’ is a description, just like ‘specialist’ is a description A software ‘generalist’ is a description, just like ‘specialist’ is a description A software ‘generalist’ is a description, just like ‘specialist’ is a description A software ‘generalist’ is a description, just like ‘specialist’ is a description ",
								"upvotes" : 0
							},
							{
								"id" : 8,
								"heading" : "What are the worst movie titles translated into your language?",
								"content" : "Israel, and the Hebrew language, have a few hilarious ones  Israel, and the Hebrew language, have a few hilarious ones  Israel, and the Hebrew language, have a few hilarious ones  Israel, and the Hebrew language, have a few hilarious ones  Israel, and the Hebrew language, have a few hilarious ones  Israel, and the Hebrew language, have a few hilarious ones  Israel, and the Hebrew language, have a few hilarious ones  Israel, and the Hebrew language, have a few hilarious ones  Israel, and the Hebrew language, have a few hilarious ones  ",
								"upvotes" : 0
							} 
				]
}