{
"posts":
							[
							{
								"id" : 1,
								"heading" : "What are the challeges of developers 10 years ago?",
								"content" : "Before OOP and modern IDEs the process of coding consisted of two steps: Write new code in the morning until your mental stack starts to overload. Spend the rest of the day implementing the changes from your mental stack. The mental stack was a huge “TO-DO” Before OOP and modern IDEs the process of coding consisted of two steps: Write new code in the morning until your mental stack starts to overload. Spend the rest of the day implementing the changes from your mental stack. The mental stack was a huge “TO-DO” Before OOP and modern IDEs the process of coding consisted of two steps: Write new code in the morning until your mental stack starts to overload. Spend the rest of the day implementing the changes from your mental stack. The mental stack was a huge “TO-DO” Before OOP and modern IDEs the process of coding consisted of two steps: Write new code in the morning until your mental stack starts to overload. Spend the rest of the day implementing the changes from your mental stack. The mental stack was a huge “TO-DO” Before OOP and modern IDEs the process of coding consisted of two steps: Write new code in the morning until your mental stack starts to overload. Spend the rest of the day implementing the changes from your mental stack. The mental stack was a huge “TO-DO” Before OOP and modern IDEs the process of coding consisted of two steps: Write new code in the morning until your mental stack starts to overload. Spend the rest of the day implementing the changes from your mental stack. The mental stack was a huge “TO-DO” Before OOP and modern IDEs the process of coding consisted of two steps: Write new code in the morning until your mental stack starts to overload. Spend the rest of the day implementing the changes from your mental stack. The mental stack was a huge “TO-DO” Before OOP and modern IDEs the process of coding consisted of two steps: Write new code in the morning until your mental stack starts to overload. Spend the rest of the day implementing the changes from your mental stack. The mental stack was a huge “TO-DO”",
								"upvotes" : 0
							},
							{
								"id" : 2,
								"heading" : "What are some stories which are really funny or hilarious but actually have a deeper meaning within?",
								"content" : "Thanks for A2A Pradeep Shanbhogue..... Go to this link... I like all of them... Six stories Thanks for A2A Pradeep Shanbhogue..... Go to this link... I like all of them... Six stories Thanks for A2A Pradeep Shanbhogue..... Go to this link... I like all of them... Six stories Thanks for A2A Pradeep Shanbhogue..... Go to this link... I like all of them... Six stories Thanks for A2A Pradeep Shanbhogue..... Go to this link... I like all of them... Six stories Thanks for A2A Pradeep Shanbhogue..... Go to this link... I like all of them... Six stories Thanks for A2A Pradeep Shanbhogue..... Go to this link... I like all of them... Six stories",
								"upvotes" : 0
							},
							{
								"id" : 3,
								"heading" : "How difficult should it be to earn an A grade at Brown?",
								"content" : "Personally, I don’t think this policy makes a lot of sense.First of all, I read somewhere that Brown defines the grades to be A = Excellent, B = Good, C = Fair. (I can’t find where, any longer.) So I want to give A’s to students who did excellent work, B’s to those who did only good work, etc. It doesn’t make sense to say “20% of the class did excellent” work and so forth. Second, it all depends on the nature of class you teach. Is it a required class? That’s very different from one that isn’t required. If it’s not required, then every student is there by choice. There is likely a great deal of self-selection: those who aren’t interested in or motivated by the topic aren’t there, those who are, are. It should hardly be surprising, then, that many students do excellent work, and should hence earn an A. (On the flip side, if everyone does poorly — and I decide, on sober Personally, I don’t think this policy makes a lot of sense.First of all, I read somewhere that Brown defines the grades to be A = Excellent, B = Good, C = Fair. (I can’t find where, any longer.) So I want to give A’s to students who did excellent work, B’s to those who did only good work, etc. It doesn’t make sense to say “20% of the class did excellent” work and so forth. Second, it all depends on the nature of class you teach. Is it a required class? That’s very different from one that isn’t required. If it’s not required, then every student is there by choice. There is likely a great deal of self-selection: those who aren’t interested in or motivated by the topic aren’t there, those who are, are. It should hardly be surprising, then, that many students do excellent work, and should hence earn an A. (On the flip side, if everyone does poorly — and I decide, on sober Personally, I don’t think this policy makes a lot of sense.First of all, I read somewhere that Brown defines the grades to be A = Excellent, B = Good, C = Fair. (I can’t find where, any longer.) So I want to give A’s to students who did excellent work, B’s to those who did only good work, etc. It doesn’t make sense to say “20% of the class did excellent” work and so forth. Second, it all depends on the nature of class you teach. Is it a required class? That’s very different from one that isn’t required. If it’s not required, then every student is there by choice. There is likely a great deal of self-selection: those who aren’t interested in or motivated by the topic aren’t there, those who are, are. It should hardly be surprising, then, that many students do excellent work, and should hence earn an A. (On the flip side, if everyone does poorly — and I decide, on sober Personally, I don’t think this policy makes a lot of sense.First of all, I read somewhere that Brown defines the grades to be A = Excellent, B = Good, C = Fair. (I can’t find where, any longer.) So I want to give A’s to students who did excellent work, B’s to those who did only good work, etc. It doesn’t make sense to say “20% of the class did excellent” work and so forth. Second, it all depends on the nature of class you teach. Is it a required class? That’s very different from one that isn’t required. If it’s not required, then every student is there by choice. There is likely a great deal of self-selection: those who aren’t interested in or motivated by the topic aren’t there, those who are, are. It should hardly be surprising, then, that many students do excellent work, and should hence earn an A. (On the flip side, if everyone does poorly — and I decide, on sober",
								"upvotes" : 0
							}
					]					
}